correct data flow
